session_3/shot/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "tags", "topic", "content", "created_at", "updated_at", "user_id", "public") VALUES (?, ?, ?, ?, ?, ?, ?, ?)