session_3/shot/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    puts user_params
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save